tap "bakks/bakks"
tap "beeftornado/rmtree"
tap "bramstein/webfonttools"
tap "cfergeau/crc"
tap "charmbracelet/tap"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
tap "romkatv/powerlevel10k"
tap "sst/tap"
tap "teamookla/speedtest"
# Run your GitHub Actions locally
brew "act"
# AI pair programming in your terminal
brew "aider"
# Core application library for C
brew "glib"
# Thread-based email index, search, and tagging
brew "notmuch"
# Text mode MUA using notmuch mail
brew "alot"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Binary installation for rust projects
brew "cargo-binstall"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# OpenType text shaping engine
brew "harfbuzz"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Testing and linting Helm charts
brew "chart-testing"
# Manage your dotfiles across multiple diverse machines, securely
brew "choose-gui"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Simple Authentication and Security Layer
brew "cyrus-sasl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# .NET Core
brew "dotnet"
# .NET Core
brew "dotnet@6"
# .NET Core
brew "dotnet@8"
# Generic library support script
brew "libtool"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Soft fork of the helix editor
brew "evil-helix"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Run SQL-like query on local files instead of database files using the GitQL SDK
brew "fileql"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# List, fetch and generate .gitignore templates
brew "git-ignore"
# High-level command-line interface for Git
brew "git-town"
# Official GitLab CI runner
brew "gitlab-runner"
# Open-source GitLab command-line tool
brew "glab"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Get events and tasks from the macOS calendar database
brew "ifstat"
# Interactive grep
brew "igrep"
# International Ispell
brew "ispell"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Git-compatible distributed version control system
brew "jj"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON query language CLI tool
brew "jql"
# Handy way to save and run project-specific commands
brew "just"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Simple terminal UI for git commands
brew "lazygit"
# TUI for Jujutsu/jj
brew "lazyjj"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Notmuch integration for Mutt
brew "notmuch-mutt"
# Package manager for Microsoft development platform including .NET
brew "nuget"
# Manage multiple Node.js versions
brew "nvm"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk@21"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql@17"
# Ruby version manager
brew "rbenv"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line hypervisor using Apple's Virtualization Framework
brew "vfkit"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Simple terminal image viewer written in Rust
brew "viu"
# Pager/text based browser
brew "w3m"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A tool for using LLMs on the command line
brew "bakks/bakks/butterfish"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@31", args: ["with-imagemagick", "with-mailutils", "with-no-frame-refocus"]
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Terraform
brew "hashicorp/tap/terraform"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# AI-powered productivity tool for the command-line
cask "amazon-q"
# Tag visualiser and search utility
cask "ammonite"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Terminal-based AI coding assistant
cask "claude-code"
# Use any mail/calendar client with an Exchange server
cask "davmail-app"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Software custom-built for content creation
cask "elgato-wave-link"
# Calendar software
cask "fantastical"
cask "font-cantarell"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-source-code-pro"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Online meetings, desktop sharing, and video conferencing
cask "gotomeeting"
# Grammarly for desktop
cask "grammarly-desktop"
# Desktop automation application
cask "hammerspoon"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Link and retrieve key information
cask "hookmark"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Enable generative AI features in iTerm2
cask "itermai"
# Enables an integrated web browser in iTerm2
cask "itermbrowserplugin"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Create, manage and debug system and user services
cask "launchcontrol"
# Kubernetes IDE
cask "lens"
# Personal AI-powered transcription and notetaking service
cask "limitless"
# App to manage software development and track bugs
cask "linear-linear"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Visual diff and merge tool
cask "meld"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Mouse control with the keyboard
cask "mouseless@preview"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# App wrapper for Postgres
cask "postgres-unofficial"
# Collaboration platform for API development
cask "postman"
# CLI for command-line API management on Postman
cask "postman-cli"
# HTTP debugging proxy
cask "proxyman"
# Keyboard-driven, vim-like browser based on PyQt5
cask "qutebrowser"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Prompt generation tool
cask "repo-prompt"
# Collection of apps available by subscription
cask "setapp"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# System monitor for the menu bar
cask "stats"
# Email client
cask "superhuman"
# Window and tab manager
cask "tabtab"
# To-do list
cask "todoist-app"
# Charting and social-networking for investment traders
cask "tradingview"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# System tray app for automatic time tracking
cask "wakatime"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# BYOK (Bring Your Own Keys) AI assistant
cask "witsy"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Desktop App for Jira", id: 6572290663
mas "Everhour", id: 1539652800
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MarkChart", id: 6475648822
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Omi", id: 6502156163
mas "Pages", id: 409201541
mas "Raycast Companion", id: 6738274497
mas "TestFlight", id: 899247664
mas "Toggl Track", id: 1291898086
mas "Tracking Time | Button", id: 1587766224
mas "Userscripts", id: 1463298887
mas "Vimkey", id: 1585682577
mas "Windows App", id: 1295203466
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "asvetliakov.vscode-neovim"
vscode "typefox.open-collaboration-tools"
