
tap "beeftornado/rmtree"
tap "bramstein/webfonttools"
tap "cfergeau/crc"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"

cask_args appdir: "~/Applications", require_sha: true

brew "glib"
brew "alot"
brew "ast-grep"
brew "atuin"
brew "autojump"
brew "awscli"
brew "blueutil"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "direnv"
brew "fisher"
brew "fzf"
brew "gh"
brew "harfbuzz"
brew "openjdk"
brew "gradle"
brew "ical-buddy"
brew "ifstat"
brew "jdtls"
brew "jj"
brew "just"
brew "libtool"
brew "libvterm"
brew "luarocks"
brew "mas"
brew "maven"
brew "mu"
brew "neovim"
brew "node"
brew "openjdk@21"
brew "ripgrep"
brew "rust"
brew "switchaudio-osx"
brew "wakatime-cli"
brew "cfergeau/crc/vfkit"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "1password-cli"
cask "aldente"
cask "alt-tab"
cask "appcleaner"
cask "discord"
cask "docker"
cask "fantastical"
cask "font-cantarell"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "homerow"
cask "hookmark"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "launchcontrol"
cask "lens"
cask "microsoft-teams"
cask "monitorcontrol"
cask "obsidian"
cask "raycast"
cask "sf-symbols"
cask "slack"
cask "stats"
cask "tradingview"
cask "wezterm"
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Grammarly for Safari", id: 1462114288
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Userscripts-Mac-App", id: 1463298887
mas "Vimari", id: 1480933944
mas "Windows App", id: 1295203466
