tap "beeftornado/rmtree"
tap "bramstein/webfonttools"
tap "cfergeau/crc"
tap "d12frosted/emacs-plus"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
brew "glib"
brew "alot"
brew "ast-grep"
brew "atuin"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "blueutil"
brew "btop"
brew "cargo-binstall"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "cyrus-sasl"
brew "direnv"
brew "docker-credential-helper", link: false
brew "dotnet"
brew "eza"
brew "fd"
brew "fileql"
brew "fisher"
brew "fzf"
brew "gh"
brew "git-flow"
brew "harfbuzz"
brew "openjdk"
brew "gradle"
brew "httpie"
brew "ical-buddy"
brew "ifstat"
brew "isync"
brew "jdtls"
brew "jj"
brew "jq"
brew "jql"
brew "just"
brew "lazygit"
brew "libtool"
brew "libvterm"
brew "luarocks"
brew "mas"
brew "maven"
brew "msmtp"
brew "mu"
brew "neomutt"
brew "neovim"
brew "node"
brew "nuget"
brew "nvm"
brew "openapi-generator"
brew "openjdk@21"
brew "pkgconf"
brew "ripgrep"
brew "rust"
brew "starship"
brew "swagger-codegen"
brew "switchaudio-osx"
brew "the_silver_searcher"
brew "wakatime-cli"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cfergeau/crc/vfkit"
brew "felixkratz/formulae/borders"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "aldente"
cask "alt-tab"
cask "appcleaner"
cask "aquamacs"
cask "discord"
cask "docker"
cask "emacs-mac"
cask "fantastical"
cask "font-cantarell"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "homerow"
cask "hookmark"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "launchcontrol"
cask "lens"
cask "microsoft-teams"
cask "monitorcontrol"
cask "obsidian"
cask "postman"
cask "postman-cli"
cask "raycast"
cask "setapp"
cask "sf-symbols"
cask "slack"
cask "stats"
cask "tabtab"
cask "tradingview"
cask "wezterm"
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Grammarly for Safari", id: 1462114288
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "TestFlight", id: 899247664
mas "Userscripts-Mac-App", id: 1463298887
mas "Vimari", id: 1480933944
mas "Windows App", id: 1295203466
